
ConvLSTM one layer 128 units
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
                                                                
 reshape_43 (Reshape)        (None, 40, 1024)          0         
                                                                 
 lstm_18 (LSTM)              (None, 128)               590336    
                                                                 
                                                                 
=================================================================
Total params: 592,266
Trainable params: 592,266
Non-trainable params: 0
_________________________________________________________________


ConvLSTM two layers 128 units
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
                                                                 
 reshape_31 (Reshape)        (None, 40, 512)           0         
                                                                 
 lstm_12 (LSTM)              (None, 128)               328192    
                                                                 
=================================================================
Total params: 395,658
Trainable params: 395,658
Non-trainable params: 0
_________________________________________________________________



















